app/controllers/armors_controller.rb

SELECT "armors".* FROM "armors"
---
  def index
    @armors = Armor.all

SELECT  "armors".* FROM "armors" WHERE "armors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_armor
      @armor = Armor.find(params[:id])