app/controllers/weapons_controller.rb

SELECT "weapons".* FROM "weapons"
---
  def index
    @weapons = Weapon.all

SELECT  "weapons".* FROM "weapons" WHERE "weapons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_weapon
      @weapon = Weapon.find(params[:id])